<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package the current Git commit of jss-autopkg-addon</string>
    <key>Identifier</key>
    <string>com.github.arubdesu.jss-autopkg-addon</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>jss-autopkg-addon</string>
        <key>URL</key>
        <string>https://github.com/arubdesu/jss-autopkg-addon/zipball/master</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.5</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Download latest jss-autopkg-addon zip archive</string>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/source</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%destination_path%</string>
            </dict>
            <key>Processor</key>
            <string>JSSAddonSourceFinder</string>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Extract a version string from version.plist to use for the package.</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%jssaddon_path%/version.plist</string>
                <key>plist_version_key</key>
                <string>Version</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Create a pkg root; we'll extract things from the disk image here.</string>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/jssaddon_root</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>01755</string>
                    <key>Library/AutoPkg</key>
                    <string>0755</string>
                    <key>Library/AutoPkg/autopkglib</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy JSSImporter.py to /Library/AutoPkg</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%jssaddon_path%/JSSImporter.py</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/AutoPkg/autopkglib/JSSImporter.py</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Make PackageInfo file for our package</string>
            <key>Processor</key>
            <string>PkgInfoCreator</string>
            <key>Arguments</key>
            <dict>
                <key>version</key>
                <string>%version%</string>
                <key>template_path</key>
                <string>PackageInfoTemplate</string>
                <key>infofile</key>
                <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                <key>pkgtype</key>
                <string>flat</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Build the package</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>com.github.arubdesu.jssAutopkgAddon</string>
                    <key>infofile</key>
                    <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
