<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Uses parent pkg recipe to downloads latest Adium and import it into the JSS.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.jss.Adium</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Adium</string>
      <key>CATEGORY</key>
      <string>Productivity</string>
      <key>POLICY_CATEGORY</key>
      <string>Testing</string>
      <key>POLICY_TEMPLATE</key>
      <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
      <key>ICON</key>
      <string>%RECIPE_DIR%/Adium.png</string>
      <key>GROUP_TEMPLATE</key>
      <string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
      <key>GROUP_NAME</key>
      <string>%NAME%-update-smart</string>
      <key>DESCRIPTION</key>
      <string>Adium is an Instant Messaging application that can be integrated with other IM applications like AIM, Yahoo, and MSN..</string>
      <!--<key>ARB_GROUP_NAME</key><string>arbitrary</string>-->
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.Adium</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>prod_name</key>
          <string>%NAME%</string>
          <key>category</key>
          <string>%CATEGORY%</string>
          <key>smart_group</key>
          <string>%SMART_GROUP%</string>
          <key>selfserve_policy</key>
          <string>%SELFSERVE_POLICY%</string>
          <!--<key>arb_group_name</key><string>%ARB_GROUP_NAME%</string>-->
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
      </dict>
    </array>
  </dict>
</plist>
