<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Uses parent pkg recipe to downloads latest AdobeAIR and import it into the JSS.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.jss.AdobeAIR</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>AdobeAIR</string>
      <key>JSS_REPO</key>
      <string>/Volumes/JSS_Dist_Point/Packages</string>
      <key>JSS_URL</key>
      <string>https://test.jss.private:8443</string>
      <key>API_USERNAME</key>
      <string>apiuser</string>
      <key>API_PASSWORD</key>
      <string>apipass</string>
      <key>CATEGORY</key>
      <string>%NAME%</string>
      <key>SELFSERVE_POLICY</key>
      <string>SelfServeLatest_%NAME%</string>
      <key>SMART_GROUP</key>
      <string>LessThanMostRecent_%NAME%</string>
      <!--<key>ARB_GROUP_NAME</key><string>arbitrary</string>-->
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.AdobeAIR</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>prod_name</key>
          <string>%NAME%</string>
          <key>repo_path</key>
          <string>%JSS_REPO%</string>
          <key>jss_url</key>
          <string>%JSS_URL%</string>
          <key>api_username</key>
          <string>%API_USERNAME%</string>
          <key>api_password</key>
          <string>%API_PASSWORD%</string>
          <key>category</key>
          <string>%NAME%</string>
          <key>selfserve_policy</key>
          <string>%SELFSERVE_POLICY%</string>
          <key>smart_group</key>
          <string>%SMART_GROUP%</string>
          <!--<key>arb_group_name</key><string>%ARB_GROUP_NAME%</string>-->
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
      </dict>
    </array>
  </dict>
</plist>