<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Uses parent pkg recipe to downloads latest OmniGraffle and import it into the JSS.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.jss.OmniGraffle</string>
    <key>Input</key>
    <dict>
      <key>CATEGORY</key>
      <string>%NAME%</string>
      <key>SMART_GROUP</key>
      <string>LessThanMostRecent_%NAME%</string>
      <key>SELFSERVE_POLICY</key>
      <string>SelfServeLatest_%NAME%</string>
      <!--<key>ARB_GROUP_NAME</key><string>arbitrary</string>-->
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.omnigraffle</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>prod_name</key>
          <string>%NAME%</string>
          <key>category</key>
          <string>%CATEGORY%</string>
          <key>smart_group</key>
          <string>%SMART_GROUP%</string>
          <key>selfserve_policy</key>
          <string>%SELFSERVE_POLICY%</string>
          <!--<key>arb_group_name</key><string>%ARB_GROUP_NAME%</string>-->
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
      </dict>
    </array>
  </dict>
</plist>